sergiistetsiuk/robotics-sumo-esp32/src/main.cpp
#include <Arduino.h>
#include <Adafruit_NeoPixel.h>
#include <Adafruit_VL53L0X.h>
#include <Update.h>
#include <WebServer.h>
#include <WiFi.h>
#include <Wire.h>

// Replace these with your Wi-Fi network credentials.
const char *WIFI_SSID = "stemlab118";
const char *WIFI_PASSWORD = "123118118";

WebServer server(80);

const uint8_t BTN_RUN_PIN = 4;
const unsigned long BUTTON_DEBOUNCE_MS = 50;
const unsigned long SENSOR_LOG_INTERVAL_MS = 1000;
const uint8_t WS2812B_PIN = 33;
const uint8_t WS2812B_LED_COUNT = 3;
const uint8_t I2C_SDA = 21;
const uint8_t I2C_SCL = 22;
const uint8_t XSHUT_RIGHT = 25;
const uint8_t XSHUT_FRONT = 26;
const uint8_t XSHUT_LEFT = 27;
const uint8_t ADDR_RIGHT = 0x30;
const uint8_t ADDR_FRONT = 0x31;
const uint8_t ADDR_LEFT = 0x32;
const uint8_t MOTOR_LEFT_PWM_PIN = 17;
const uint8_t MOTOR_LEFT_DIR_PIN = 16;
const uint8_t MOTOR_RIGHT_PWM_PIN = 19;
const uint8_t MOTOR_RIGHT_DIR_PIN = 18;
const uint32_t pwmFreq = 5000;
const uint8_t pwmResolution = 8;
const uint8_t MOTOR_RUN_DUTY = 26;
const uint8_t MOTOR_STOP_DUTY = 255;
const uint8_t MOTOR_LEFT_PWM_CHANNEL = 0;
const uint8_t MOTOR_RIGHT_PWM_CHANNEL = 1;
const uint8_t LINE_SENSOR_PIN = 23;
const uint8_t LINE_SENSOR_ACTIVE_STATE = HIGH;

// Sumo behavior tuning. Motor values are signed: +forward, -reverse, 0 stop.
const unsigned long START_DELAY_MS = 5000;
const unsigned long START_DELAY_BLINK_MS = 1000;
const unsigned long ESCAPE_BACKUP_MS = 260;
const unsigned long ESCAPE_TURN_MS = 360;
const bool ENABLE_LINE_DETECTION = false;
const uint16_t MAX_VISIBLE_OPPONENT_MM = 500;
const uint16_t measureDistanceMin = MAX_VISIBLE_OPPONENT_MM;
constexpr int16_t speedPercent(uint8_t percent)
{
  return static_cast<int16_t>((static_cast<uint16_t>(percent) * 255) / 100);
}

const int16_t SPEED_STOP = 0;
const int16_t SPEED_ATTACK = speedPercent(10);
const int16_t SPEED_ATTACK_CORRECT_INSIDE = speedPercent(4);
const int16_t SPEED_ALIGN_TURN = speedPercent(4);
const int16_t SPEED_SEARCH_TURN = speedPercent(4);
const int16_t SPEED_ESCAPE_BACKUP = speedPercent(6);
const int16_t SPEED_ESCAPE_TURN = speedPercent(4);

Adafruit_NeoPixel ws2812b(WS2812B_LED_COUNT, WS2812B_PIN, NEO_BRG + NEO_KHZ800);
Adafruit_VL53L0X sensorRight;
Adafruit_VL53L0X sensorFront;
Adafruit_VL53L0X sensorLeft;

const size_t MAX_LOG_LINES = 80;
String logLines[MAX_LOG_LINES];
size_t logLineCount = 0;
size_t logWriteIndex = 0;

bool otaSuccess = false;
String otaMessage;

bool lastRunButtonReading = HIGH;
bool stableRunButtonState = HIGH;
unsigned long lastRunButtonChangeMs = 0;
bool projectRunning = false;
unsigned long lastSensorLogMs = 0;
bool sensorRightReady = false;
bool sensorFrontReady = false;
bool sensorLeftReady = false;

enum class RobotMode
{
  WaitingForStart,
  StartDelay,
  Running
};

enum class EscapePhase
{
  None,
  BackingUp,
  TurningInside
};

enum class MoveDirection
{
  Left,
  Right
};

RobotMode robotMode = RobotMode::WaitingForStart;
EscapePhase escapePhase = EscapePhase::None;
MoveDirection moveDirection = MoveDirection::Left;
unsigned long robotModeStartedMs = 0;
unsigned long escapePhaseStartedMs = 0;
bool escapeTurnLeft = true;

void setupWiFi();
void setupWebOTA();
void addLog(const String &message);
String getUptime();
void handleRoot();
void handleLogs();
void handleStatus();
void handleClearLogs();
void handleReset();
void handleFirmwareUpload();
void setWs2812bColor(uint8_t red, uint8_t green, uint8_t blue);
void setupDistanceSensors();
bool setupDistanceSensor(Adafruit_VL53L0X &sensor, const String &name, uint8_t xshutPin, uint8_t address);
void logDistanceSensors();
String readDistanceSensor(Adafruit_VL53L0X &sensor, bool ready);
bool readDistanceMillimeters(Adafruit_VL53L0X &sensor, bool ready, uint16_t &distanceMm);
void setupMotors();
void attachMotorPwm(uint8_t pin, uint8_t channel);
void writeMotorPwm(uint8_t pin, uint8_t channel, uint8_t duty);
void setMotorsSpeed(uint8_t duty);
uint8_t motorSpeedToActiveLowDuty(int16_t speed);
void setMotorOutputs(int16_t leftSpeed, int16_t rightSpeed);
void setupLineSensor();
String readLineSensorStatus();
void setProjectRunning(bool running);
void setupProject();
void loopProject();
void waitForStart();
bool checkArenaBoundary();
void attackOpponent();
void searchForOpponent();
void moveForward(int16_t speed);
void attackForwardLeft();
void attackForwardRight();
void turnLeft(int16_t speed);
void turnRight(int16_t speed);
uint16_t measuredDistanceOrMax(Adafruit_VL53L0X &sensor, bool ready);
bool isLineDetected();

String htmlEscape(const String &text)
{
  String escaped;
  escaped.reserve(text.length());

  for (size_t i = 0; i < text.length(); i++)
  {
    const char c = text.charAt(i);
    switch (c)
    {
    case '&':
      escaped += F("&amp;");
      break;
    case '<':
      escaped += F("&lt;");
      break;
    case '>':
      escaped += F("&gt;");
      break;
    case '"':
      escaped += F("&quot;");
      break;
    case '\'':
      escaped += F("&#39;");
      break;
    default:
      escaped += c;
      break;
    }
  }

  return escaped;
}

String jsonEscape(const String &text)
{
  String escaped;
  escaped.reserve(text.length());

  for (size_t i = 0; i < text.length(); i++)
  {
    const char c = text.charAt(i);
    switch (c)
    {
    case '\\':
      escaped += F("\\\\");
      break;
    case '"':
      escaped += F("\\\"");
      break;
    case '\n':
      escaped += F("\\n");
      break;
    case '\r':
      escaped += F("\\r");
      break;
    case '\t':
      escaped += F("\\t");
      break;
    default:
      if (static_cast<uint8_t>(c) < 0x20)
      {
        escaped += ' ';
      }
      else
      {
        escaped += c;
      }
      break;
    }
  }

  return escaped;
}

String getLogText()
{
  String output;
  const size_t start = (logLineCount == MAX_LOG_LINES) ? logWriteIndex : 0;

  for (size_t i = 0; i < logLineCount; i++)
  {
    const size_t index = (start + i) % MAX_LOG_LINES;
    output += logLines[index];
    output += '\n';
  }

  return output;
}

