sergiistetsiuk/robotics-sumo-esp32/src/main.cpp
void setupWiFi()
{
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  Serial.print(F("Connecting to Wi-Fi"));

  while (WiFi.status() != WL_CONNECTED)
  {
    delay(500);
    Serial.print('.');
  }

  Serial.println();
  addLog("Wi-Fi connected");
  addLog("IP address: " + WiFi.localIP().toString());
}

void setupWebOTA()
{
  server.on("/", HTTP_GET, handleRoot);
  server.on("/logs", HTTP_GET, handleLogs);
  server.on("/status", HTTP_GET, handleStatus);
  server.on("/clear-logs", HTTP_POST, handleClearLogs);
  server.on("/reset", HTTP_POST, handleReset);
  server.on(
      "/update", HTTP_POST,
      []()
      {
        const int statusCode = otaSuccess ? 200 : 500;
        const String statusClass = otaSuccess ? "success" : "error";
        const String title = otaSuccess ? "Firmware uploaded successfully" : "Firmware upload failed";
        const String details = otaSuccess ? "The ESP32 will reboot now. This page will return to the main interface automatically."
                                          : otaMessage;

        String page = F("<!doctype html><html><head><meta charset='utf-8'>"
                        "<meta name='viewport' content='width=device-width,initial-scale=1'>");

        page += F("<title>ESP32 OTA</title><style>"
                  "body{margin:0;min-height:100vh;display:grid;place-items:center;background:#f3f6fb;color:#172033;font-family:Arial,sans-serif}"
                  ".box{width:min(92vw,560px);background:#fff;border:1px solid #d9e1ef;border-radius:8px;padding:28px;box-shadow:0 18px 45px rgba(20,34,58,.12)}"
                  "h1{margin:0 0 12px;font-size:24px}.success{color:#147a45}.error{color:#b42318}"
                  "p{line-height:1.5}.btn{display:inline-block;margin-top:14px;padding:11px 16px;border-radius:6px;background:#1f6feb;color:#fff;text-decoration:none}"
                  "</style></head><body><main class='box'>");
        page += "<h1 class='" + statusClass + "'>" + htmlEscape(title) + "</h1>";
        page += "<p>" + htmlEscape(details) + "</p>";
        page += F("<a class='btn' href='/'>Back to dashboard</a></main>");

        if (otaSuccess)
        {
          page += F("<script>"
                    "let attempts=0;"
                    "function goHomeWhenReady(){"
                    "attempts++;"
                    "fetch('/',{cache:'no-store'})"
                    ".then(function(response){if(response.ok){location.href='/';return;}throw new Error('not ready');})"
                    ".catch(function(){setTimeout(goHomeWhenReady,1500);});"
                    "}"
                    "setTimeout(goHomeWhenReady,5000);"
                    "</script>");
        }

        page += F("</body></html>");
        server.send(statusCode, "text/html", page);

        if (otaSuccess)
        {
          addLog("OTA upload completed successfully; rebooting");
          delay(1000);
          ESP.restart();
        }
      },
      handleFirmwareUpload);

  server.begin();
  addLog("Web OTA server started on http://" + WiFi.localIP().toString() + "/");
  addLog("Sketch size: " + String(ESP.getSketchSize()) + " bytes");
  addLog("Free OTA space: " + String(ESP.getFreeSketchSpace()) + " bytes");
}

void addLog(const String &message)
{
  const String line = "[" + getUptime() + "] " + message;

  Serial.println(line);
  logLines[logWriteIndex] = line;
  logWriteIndex = (logWriteIndex + 1) % MAX_LOG_LINES;

  if (logLineCount < MAX_LOG_LINES)
  {
    logLineCount++;
  }
}

void clearLogs()
{
  for (size_t i = 0; i < MAX_LOG_LINES; i++)
  {
    logLines[i] = "";
  }

  logLineCount = 0;
  logWriteIndex = 0;
}

String getUptime()
{
  const uint64_t totalSeconds = millis() / 1000;
  const uint32_t days = totalSeconds / 86400;
  const uint8_t hours = (totalSeconds % 86400) / 3600;
  const uint8_t minutes = (totalSeconds % 3600) / 60;
  const uint8_t seconds = totalSeconds % 60;

  char buffer[32];

  if (days > 0)
  {
    snprintf(buffer, sizeof(buffer), "%lud %02u:%02u:%02u", static_cast<unsigned long>(days), hours, minutes, seconds);
  }
  else
  {
    snprintf(buffer, sizeof(buffer), "%02u:%02u:%02u", hours, minutes, seconds);
  }

  return String(buffer);
}

void handleRoot()
{
  const String ipAddress = WiFi.localIP().toString();

  String page = F(R"rawliteral(
<!doctype html>
<html lang="en">
<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <title>ESP32 Web OTA</title>
  <style>
    :root {
      color-scheme: light;
      --bg: #f4f7fb;
      --panel: #ffffff;
      --text: #172033;
      --muted: #5f6f86;
      --line: #dbe3ef;
      --primary: #1f6feb;
      --primary-dark: #174ea6;
      --danger: #b42318;
      --success: #147a45;
      --log-bg: #101828;
      --log-text: #d6e4ff;
    }

    * {
      box-sizing: border-box;
    }

    body {
      margin: 0;
      min-height: 100vh;
      background: var(--bg);
      color: var(--text);
      font-family: Arial, Helvetica, sans-serif;
    }

    .shell {
      width: min(1120px, calc(100% - 28px));
      margin: 0 auto;
      padding: 28px 0;
    }

    header {
      display: flex;
      align-items: flex-start;
      justify-content: space-between;
      gap: 18px;
      margin-bottom: 18px;
    }

    h1 {
      margin: 0 0 6px;
      font-size: clamp(28px, 5vw, 42px);
      line-height: 1.05;
      letter-spacing: 0;
    }

    .subtitle {
      margin: 0;
      color: var(--muted);
      font-size: 15px;
    }

    .status-grid {
      display: grid;
      grid-template-columns: repeat(2, minmax(130px, 1fr));
      gap: 10px;
      min-width: min(100%, 330px);
    }

    .status-card {
      background: var(--panel);
      border: 1px solid var(--line);
      border-radius: 8px;
      padding: 13px 14px;
    }

    .status-card span {
      display: block;
      color: var(--muted);
      font-size: 12px;
      text-transform: uppercase;
      letter-spacing: .06em;
      margin-bottom: 7px;
    }

    .status-card strong {
      display: block;
      overflow-wrap: anywhere;
      font-size: 17px;
    }

    .panel {
      background: var(--panel);
      border: 1px solid var(--line);
      border-radius: 8px;
      overflow: hidden;
      box-shadow: 0 18px 45px rgba(20, 34, 58, .10);
    }

    .tabs {
      display: flex;
      gap: 0;
      border-bottom: 1px solid var(--line);
      background: #eef3fa;
    }

    .tab-button {
      appearance: none;
      border: 0;
      border-right: 1px solid var(--line);
      background: transparent;
      color: var(--muted);
      cursor: pointer;
      font: inherit;
      font-weight: 700;
      padding: 15px 18px;
      min-width: 150px;
    }

    .tab-button.active {
      background: var(--panel);
      color: var(--primary-dark);
    }

    .tab-content {
      display: none;
      padding: 18px;
    }

    .tab-content.active {
      display: block;
    }

