sergiistetsiuk/robotics-sumo-esp32/src/main.cpp
    .log-toolbar {
      display: flex;
      justify-content: space-between;
      gap: 12px;
      align-items: center;
      margin-bottom: 12px;
    }

    .log-toolbar p {
      color: var(--muted);
      margin: 0;
      font-size: 14px;
    }

    .actions {
      display: flex;
      flex-wrap: wrap;
      gap: 10px;
      justify-content: flex-end;
    }

    .action-button {
      appearance: none;
      border: 1px solid var(--line);
      border-radius: 6px;
      background: #fff;
      color: var(--text);
      cursor: pointer;
      font: inherit;
      font-weight: 700;
      padding: 10px 13px;
    }

    .action-button:hover {
      border-color: #9fb0c8;
      background: #f8fbff;
    }

    .action-button:disabled {
      cursor: wait;
      opacity: .65;
    }

    .action-button.danger {
      border-color: #f0b8b2;
      color: var(--danger);
    }

    .action-button.danger:hover {
      background: #fff5f4;
    }

    pre {
      width: 100%;
      min-height: 420px;
      max-height: 62vh;
      overflow: auto;
      margin: 0;
      padding: 16px;
      border-radius: 8px;
      background: var(--log-bg);
      color: var(--log-text);
      font: 14px/1.45 "SFMono-Regular", Consolas, "Liberation Mono", monospace;
      white-space: pre-wrap;
      word-break: break-word;
    }

    form {
      display: grid;
      gap: 14px;
      max-width: 680px;
    }

    label {
      display: grid;
      gap: 8px;
      color: var(--muted);
      font-weight: 700;
    }

    input[type="file"] {
      width: 100%;
      border: 1px dashed #aab8cc;
      border-radius: 8px;
      padding: 18px;
      background: #f8fbff;
      color: var(--text);
    }

    button[type="submit"] {
      justify-self: start;
      min-width: 170px;
      border: 0;
      border-radius: 6px;
      background: var(--primary);
      color: #fff;
      cursor: pointer;
      font: inherit;
      font-weight: 700;
      padding: 12px 18px;
    }

    button[type="submit"]:hover {
      background: var(--primary-dark);
    }

    .notice {
      margin: 0;
      color: var(--muted);
      line-height: 1.5;
    }

    .message {
      min-height: 24px;
      font-weight: 700;
    }

    .message.error {
      color: var(--danger);
    }

    .message.success {
      color: var(--success);
    }

    @media (max-width: 720px) {
      header {
        display: grid;
      }

      .status-grid {
        grid-template-columns: 1fr;
      }

      .tabs {
        display: grid;
        grid-template-columns: 1fr 1fr;
      }

      .tab-button {
        min-width: 0;
        padding-inline: 10px;
      }

      .log-toolbar {
        display: grid;
      }

      pre {
        min-height: 360px;
      }
    }
  </style>
</head>
<body>
  <main class="shell">
    <header>
      <div>
        <h1>ESP32 Web OTA</h1>
        <p class="subtitle">Wireless firmware updates and live board diagnostics.</p>
      </div>
      <section class="status-grid" aria-label="Device status">
        <div class="status-card">
          <span>IP Address</span>
          <strong id="ipAddress">)rawliteral");

  page += htmlEscape(ipAddress);

  page += F(R"rawliteral(</strong>
        </div>
        <div class="status-card">
          <span>Uptime</span>
          <strong id="uptime">)rawliteral");

  page += htmlEscape(getUptime());

  page += F(R"rawliteral(</strong>
        </div>
      </section>
    </header>

    <section class="panel">
      <nav class="tabs" aria-label="Main tabs">
        <button class="tab-button active" type="button" data-tab="logs">Board Logs</button>
        <button class="tab-button" type="button" data-tab="upload">Firmware Upload</button>
      </nav>

      <section id="tab-logs" class="tab-content active">
        <div class="log-toolbar">
          <p>Live board logs update automatically.</p>
          <div class="actions">
            <button id="clearLogsButton" class="action-button" type="button">Clear Logs</button>
            <button id="resetButton" class="action-button danger" type="button">Reset ESP32</button>
          </div>
        </div>
        <pre id="logs">Loading logs...</pre>
      </section>

      <section id="tab-upload" class="tab-content">
        <form id="uploadForm" method="POST" action="/update" enctype="multipart/form-data">
          <label>
            Firmware .bin file
            <input id="firmwareFile" type="file" name="firmware" accept=".bin,application/octet-stream" required>
          </label>
          <p class="notice">Upload a PlatformIO firmware binary. The board will reboot automatically after a successful update.</p>
          <button type="submit">Upload Firmware</button>
          <div id="uploadMessage" class="message" role="status"></div>
        </form>
      </section>
    </section>
  </main>

  <script>
    const buttons = document.querySelectorAll('.tab-button');
    const logsEl = document.getElementById('logs');
    const uptimeEl = document.getElementById('uptime');
    const ipAddressEl = document.getElementById('ipAddress');
    const uploadForm = document.getElementById('uploadForm');
    const firmwareFile = document.getElementById('firmwareFile');
    const uploadMessage = document.getElementById('uploadMessage');
    const clearLogsButton = document.getElementById('clearLogsButton');
    const resetButton = document.getElementById('resetButton');

    buttons.forEach((button) => {
      button.addEventListener('click', () => {
        const tab = button.dataset.tab;

        buttons.forEach((item) => item.classList.toggle('active', item === button));
        document.querySelectorAll('.tab-content').forEach((content) => {
          content.classList.toggle('active', content.id === `tab-${tab}`);
        });
      });
    });

    async function refreshLogs() {
      try {
        const response = await fetch('/logs', { cache: 'no-store' });
        const text = await response.text();
        const shouldStickToBottom = logsEl.scrollTop + logsEl.clientHeight >= logsEl.scrollHeight - 24;
        logsEl.textContent = text || 'No logs yet.';

        if (shouldStickToBottom) {
          logsEl.scrollTop = logsEl.scrollHeight;
        }
      } catch (error) {
        logsEl.textContent = 'Unable to load logs.';
      }
    }

