sergiistetsiuk/robotics-sumo-esp32/src/main.cpp
    async function refreshStatus() {
      try {
        const response = await fetch('/status', { cache: 'no-store' });
        const status = await response.json();
        uptimeEl.textContent = status.uptime;
        ipAddressEl.textContent = status.ip;
      } catch (error) {
        uptimeEl.textContent = 'Unavailable';
      }
    }

    uploadForm.addEventListener('submit', (event) => {
      const file = firmwareFile.files[0];
      uploadMessage.className = 'message';
      uploadMessage.textContent = '';

      if (!file || !file.name.toLowerCase().endsWith('.bin')) {
        event.preventDefault();
        uploadMessage.classList.add('error');
        uploadMessage.textContent = 'Please choose a .bin firmware file.';
        return;
      }

      uploadMessage.classList.add('success');
      uploadMessage.textContent = 'Uploading firmware. Keep this page open.';
    });

    clearLogsButton.addEventListener('click', async () => {
      clearLogsButton.disabled = true;

      try {
        await fetch('/clear-logs', { method: 'POST', cache: 'no-store' });
        await refreshLogs();
      } finally {
        clearLogsButton.disabled = false;
      }
    });

    resetButton.addEventListener('click', async () => {
      if (!confirm('Reset the ESP32 now?')) {
        return;
      }

      resetButton.disabled = true;

      try {
        await fetch('/reset', { method: 'POST', cache: 'no-store' });
        logsEl.textContent = 'Reset requested. Reconnecting...';
        setTimeout(() => location.reload(), 8000);
      } catch (error) {
        setTimeout(() => location.reload(), 8000);
      }
    });

    refreshLogs();
    refreshStatus();
    setInterval(refreshLogs, 1000);
    setInterval(refreshStatus, 1000);
  </script>
</body>
</html>
)rawliteral");

  server.send(200, "text/html", page);
}

void handleLogs()
{
  server.send(200, "text/plain", getLogText());
}

void handleClearLogs()
{
  clearLogs();
  addLog("Logs cleared from web interface");
  server.send(200, "text/plain", "Logs cleared");
}

void handleReset()
{
  addLog("Reset requested from web interface");
  server.send(200, "text/plain", "Reset requested");
  delay(500);
  ESP.restart();
}

void handleStatus()
{
  String response = "{";
  response += "\"ip\":\"" + jsonEscape(WiFi.localIP().toString()) + "\",";
  response += "\"uptime\":\"" + jsonEscape(getUptime()) + "\",";
  response += "\"rssi\":" + String(WiFi.RSSI()) + ",";
  response += "\"freeHeap\":" + String(ESP.getFreeHeap());
  response += "}";

  server.send(200, "application/json", response);
}

void handleFirmwareUpload()
{
  HTTPUpload &upload = server.upload();

  if (upload.status == UPLOAD_FILE_START)
  {
    otaSuccess = false;
    otaMessage = "";

    const String filename = upload.filename;

    if (!filename.endsWith(".bin"))
    {
      otaMessage = "Only .bin firmware files are accepted.";
      addLog("OTA rejected: " + otaMessage);
      return;
    }

    addLog("OTA upload started: " + filename);
    addLog("Free OTA space before upload: " + String(ESP.getFreeSketchSpace()) + " bytes");

    const size_t freeSketchSpace = ESP.getFreeSketchSpace();
    const size_t updateSpace = freeSketchSpace > 0x1000 ? (freeSketchSpace - 0x1000) & 0xFFFFF000 : 0;

    if (updateSpace == 0)
    {
      otaMessage = "No OTA update partition is available. Flash once by USB with an OTA partition table.";
      addLog("OTA begin failed: " + otaMessage);
    }
    else if (!Update.begin(updateSpace))
    {
      otaMessage = Update.errorString();
      addLog("OTA begin failed: " + otaMessage);
    }
  }
  else if (upload.status == UPLOAD_FILE_WRITE)
  {
    if (otaMessage.length() == 0)
    {
      const size_t written = Update.write(upload.buf, upload.currentSize);

      if (written != upload.currentSize)
      {
        otaMessage = Update.errorString();
        addLog("OTA write failed: " + otaMessage);
      }
    }
  }
  else if (upload.status == UPLOAD_FILE_END)
  {
    if (otaMessage.length() == 0 && Update.end(true))
    {
      otaSuccess = true;
      otaMessage = "Upload complete.";
      addLog("OTA upload size: " + String(upload.totalSize) + " bytes");
    }
    else
    {
      otaSuccess = false;

      if (otaMessage.length() == 0)
      {
        otaMessage = Update.errorString();
      }

      addLog("OTA end failed: " + otaMessage);
    }
  }
  else if (upload.status == UPLOAD_FILE_ABORTED)
  {
    Update.abort();
    otaSuccess = false;
    otaMessage = "Upload was aborted.";
    addLog("OTA aborted");
  }
}

void setWs2812bColor(uint8_t red, uint8_t green, uint8_t blue)
{
  const uint32_t color = ws2812b.Color(red, green, blue);

  for (uint8_t i = 0; i < WS2812B_LED_COUNT; i++)
  {
    ws2812b.setPixelColor(i, color);
  }

  ws2812b.show();
}

void setupDistanceSensors()
{
  Wire.begin(I2C_SDA, I2C_SCL);

  pinMode(XSHUT_RIGHT, OUTPUT);
  pinMode(XSHUT_FRONT, OUTPUT);
  pinMode(XSHUT_LEFT, OUTPUT);

  digitalWrite(XSHUT_RIGHT, LOW);
  digitalWrite(XSHUT_FRONT, LOW);
  digitalWrite(XSHUT_LEFT, LOW);
  delay(10);

  addLog("I2C initialized on SDA " + String(I2C_SDA) + ", SCL " + String(I2C_SCL));

  sensorRightReady = setupDistanceSensor(sensorRight, "right", XSHUT_RIGHT, ADDR_RIGHT);
  sensorFrontReady = setupDistanceSensor(sensorFront, "front", XSHUT_FRONT, ADDR_FRONT);
  sensorLeftReady = setupDistanceSensor(sensorLeft, "left", XSHUT_LEFT, ADDR_LEFT);
}

bool setupDistanceSensor(Adafruit_VL53L0X &sensor, const String &name, uint8_t xshutPin, uint8_t address)
{
  digitalWrite(xshutPin, HIGH);
  delay(10);

  if (!sensor.begin(address, false, &Wire))
  {
    addLog("VL53L0X " + name + " init failed on XSHUT GPIO " + String(xshutPin));
    return false;
  }

  addLog("VL53L0X " + name + " initialized at address 0x" + String(address, HEX));
  return true;
}

String readDistanceSensor(Adafruit_VL53L0X &sensor, bool ready)
{
  uint16_t distanceMm = 0;

  if (readDistanceMillimeters(sensor, ready, distanceMm))
  {
    return String(distanceMm) + " mm";
  }

