sergiistetsiuk/robotics-sumo-esp32/src/main.cpp
  if (!ready)
  {
    return "not ready";
  }

  return "out of range";
}

bool readDistanceMillimeters(Adafruit_VL53L0X &sensor, bool ready, uint16_t &distanceMm)
{
  if (!ready)
  {
    return false;
  }

  VL53L0X_RangingMeasurementData_t measurement;
  sensor.rangingTest(&measurement, false);

  if (measurement.RangeStatus == 4)
  {
    return false;
  }

  distanceMm = measurement.RangeMilliMeter;
  return true;
}

void logDistanceSensors()
{
  const String rightValue = readDistanceSensor(sensorRight, sensorRightReady);
  const String frontValue = readDistanceSensor(sensorFront, sensorFrontReady);
  const String leftValue = readDistanceSensor(sensorLeft, sensorLeftReady);

  addLog("VL53L0X distances - right: " + rightValue + ", front: " + frontValue + ", left: " + leftValue);
  addLog("Line sensor status: " + readLineSensorStatus());
}

void setupMotors()
{
  pinMode(MOTOR_LEFT_PWM_PIN, OUTPUT);
  pinMode(MOTOR_RIGHT_PWM_PIN, OUTPUT);
  pinMode(MOTOR_LEFT_DIR_PIN, OUTPUT);
  pinMode(MOTOR_RIGHT_DIR_PIN, OUTPUT);

  digitalWrite(MOTOR_LEFT_PWM_PIN, HIGH);
  digitalWrite(MOTOR_RIGHT_PWM_PIN, HIGH);
  digitalWrite(MOTOR_LEFT_DIR_PIN, LOW);
  digitalWrite(MOTOR_RIGHT_DIR_PIN, LOW);

  attachMotorPwm(MOTOR_LEFT_PWM_PIN, MOTOR_LEFT_PWM_CHANNEL);
  attachMotorPwm(MOTOR_RIGHT_PWM_PIN, MOTOR_RIGHT_PWM_CHANNEL);
  setMotorsSpeed(0);

  addLog("Motors initialized: left PWM GPIO " + String(MOTOR_LEFT_PWM_PIN) + ", left DIR GPIO " + String(MOTOR_LEFT_DIR_PIN));
  addLog("Motors initialized: right PWM GPIO " + String(MOTOR_RIGHT_PWM_PIN) + ", right DIR GPIO " + String(MOTOR_RIGHT_DIR_PIN));
}

void attachMotorPwm(uint8_t pin, uint8_t channel)
{
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcAttach(pin, pwmFreq, pwmResolution);
#else
  ledcSetup(channel, pwmFreq, pwmResolution);
  ledcAttachPin(pin, channel);
#endif
}

void writeMotorPwm(uint8_t pin, uint8_t channel, uint8_t duty)
{
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(pin, duty);
#else
  ledcWrite(channel, duty);
#endif
}

void setMotorsSpeed(uint8_t duty)
{
  const uint8_t invertedDuty = motorSpeedToActiveLowDuty(duty);

  writeMotorPwm(MOTOR_LEFT_PWM_PIN, MOTOR_LEFT_PWM_CHANNEL, invertedDuty);
  writeMotorPwm(MOTOR_RIGHT_PWM_PIN, MOTOR_RIGHT_PWM_CHANNEL, invertedDuty);
}

uint8_t motorSpeedToActiveLowDuty(int16_t speed)
{
  // Motor PWM is inverted: 255 means stopped, 0 means maximum power.
  const int16_t safeSpeed = constrain(abs(speed), 0, 255);
  return MOTOR_STOP_DUTY - safeSpeed;
}

void setMotorOutputs(int16_t leftSpeed, int16_t rightSpeed)
{
  leftSpeed = constrain(leftSpeed, -255, 255);
  rightSpeed = constrain(rightSpeed, -255, 255);

  // Direction HIGH is treated as forward because that is how the original
  // motor test code drove the robot. Reverse is used for boundary escape.
  digitalWrite(MOTOR_LEFT_DIR_PIN, leftSpeed >= 0 ? HIGH : LOW);
  digitalWrite(MOTOR_RIGHT_DIR_PIN, rightSpeed >= 0 ? HIGH : LOW);

  writeMotorPwm(MOTOR_LEFT_PWM_PIN, MOTOR_LEFT_PWM_CHANNEL, motorSpeedToActiveLowDuty(leftSpeed));
  writeMotorPwm(MOTOR_RIGHT_PWM_PIN, MOTOR_RIGHT_PWM_CHANNEL, motorSpeedToActiveLowDuty(rightSpeed));
}

void setupLineSensor()
{
  pinMode(LINE_SENSOR_PIN, INPUT);
  addLog("Line sensor initialized on GPIO " + String(LINE_SENSOR_PIN));
  addLog("Line sensor status: " + readLineSensorStatus());
}

String readLineSensorStatus()
{
  const uint8_t rawState = digitalRead(LINE_SENSOR_PIN);
  const String stateText = rawState == HIGH ? "HIGH" : "LOW";
  const String lineText = rawState == LINE_SENSOR_ACTIVE_STATE ? "line detected" : "no line";

  return lineText + " (raw " + stateText + ")";
}

void setProjectRunning(bool running)
{
  projectRunning = running;

  if (projectRunning)
  {
    setWs2812bColor(255, 0, 0);
    setMotorOutputs(SPEED_STOP, SPEED_STOP);
    lastSensorLogMs = 0;
    addLog("Project status: running");
    addLog("WS2812B color: red");
    addLog("Sumo algorithm active");
  }
  else
  {
    setMotorOutputs(SPEED_STOP, SPEED_STOP);
    setWs2812bColor(0, 255, 0);
    addLog("Project status: stopped");
    addLog("WS2812B color: green");
    addLog("Motors stopped");
  }
}

void setupProject()
{
  pinMode(BTN_RUN_PIN, INPUT_PULLUP);
  lastRunButtonReading = digitalRead(BTN_RUN_PIN);
  stableRunButtonState = lastRunButtonReading;

  ws2812b.begin();
  ws2812b.setBrightness(60);

  setupLineSensor();
  setupDistanceSensors();
  setProjectRunning(false);

  // Add your own project initialization code here.
  addLog("BTN_RUN_PIN initialized on GPIO " + String(BTN_RUN_PIN));
  addLog("WS2812B initialized on GPIO " + String(WS2812B_PIN) + " with " + String(WS2812B_LED_COUNT) + " LEDs");
  addLog("Project setup complete");
}

void loopProject()
{
  waitForStart();

  if (!projectRunning)
  {
    return;
  }

  // The boundary check always wins. It may take over the motors for a short
  // non-blocking escape sequence before normal attack/search resumes.
  if (checkArenaBoundary())
  {
    return;
  }

  attackOpponent();

  if (lastSensorLogMs == 0 || millis() - lastSensorLogMs >= SENSOR_LOG_INTERVAL_MS)
  {
    lastSensorLogMs = millis();
    logDistanceSensors();
  }
}

void waitForStart()
{
  const unsigned long now = millis();
  const bool currentReading = digitalRead(BTN_RUN_PIN);

  if (currentReading != lastRunButtonReading)
  {
    lastRunButtonChangeMs = now;
    lastRunButtonReading = currentReading;
  }

  if ((now - lastRunButtonChangeMs) > BUTTON_DEBOUNCE_MS && currentReading != stableRunButtonState)
  {
    stableRunButtonState = currentReading;

    if (stableRunButtonState == HIGH)
    {
      if (robotMode == RobotMode::WaitingForStart)
      {
        robotMode = RobotMode::StartDelay;
        robotModeStartedMs = now;
        setWs2812bColor(255, 0, 0);
        setMotorOutputs(SPEED_STOP, SPEED_STOP);
        addLog("START released; waiting 5 seconds before sumo algorithm");
      }
      else
      {
        robotMode = RobotMode::WaitingForStart;
        escapePhase = EscapePhase::None;
        setProjectRunning(false);
        addLog("START released; sumo algorithm stopped");
      }
    }
  }

  if (robotMode == RobotMode::StartDelay)
  {
    const unsigned long delayElapsedMs = now - robotModeStartedMs;

