sergiistetsiuk/robotics-sumo-esp32/src/main.cpp
    if (delayElapsedMs >= START_DELAY_MS)
    {
      robotMode = RobotMode::Running;
      escapePhase = EscapePhase::None;
      moveDirection = MoveDirection::Left;
      setProjectRunning(true);
      addLog("Start delay complete; entering sumo mode");
    }
    else if ((delayElapsedMs / START_DELAY_BLINK_MS) % 2 == 0)
    {
      setWs2812bColor(255, 0, 0);
    }
    else
    {
      setWs2812bColor(0, 255, 0);
    }
  }
}

bool checkArenaBoundary()
{
  if (!ENABLE_LINE_DETECTION)
  {
    return false;
  }

  const unsigned long now = millis();

  if (isLineDetected() && escapePhase == EscapePhase::None)
  {
    escapePhase = EscapePhase::BackingUp;
    escapePhaseStartedMs = now;
    escapeTurnLeft = !escapeTurnLeft;
    setMotorOutputs(-SPEED_ESCAPE_BACKUP, -SPEED_ESCAPE_BACKUP);
    addLog("Arena boundary detected; backing up");
    return true;
  }

  if (escapePhase == EscapePhase::BackingUp)
  {
    setMotorOutputs(-SPEED_ESCAPE_BACKUP, -SPEED_ESCAPE_BACKUP);

    if (now - escapePhaseStartedMs >= ESCAPE_BACKUP_MS)
    {
      escapePhase = EscapePhase::TurningInside;
      escapePhaseStartedMs = now;
      addLog("Boundary escape: turning back inside");
    }

    return true;
  }

  if (escapePhase == EscapePhase::TurningInside)
  {
    if (escapeTurnLeft)
    {
      setMotorOutputs(-SPEED_ESCAPE_TURN, SPEED_ESCAPE_TURN);
    }
    else
    {
      setMotorOutputs(SPEED_ESCAPE_TURN, -SPEED_ESCAPE_TURN);
    }

    if (now - escapePhaseStartedMs >= ESCAPE_TURN_MS && !isLineDetected())
    {
      escapePhase = EscapePhase::None;
      moveDirection = MoveDirection::Left;
      addLog("Boundary escape complete");
    }

    return true;
  }

  return false;
}

void attackOpponent()
{
  const uint16_t measuredFront = measuredDistanceOrMax(sensorFront, sensorFrontReady);
  const uint16_t measuredLeft = measuredDistanceOrMax(sensorLeft, sensorLeftReady);
  const uint16_t measuredRight = measuredDistanceOrMax(sensorRight, sensorRightReady);
  const bool frontDetected = measuredFront < measureDistanceMin;
  const bool leftDetected = measuredLeft < measureDistanceMin;
  const bool rightDetected = measuredRight < measureDistanceMin;

  if (frontDetected && leftDetected)
  {
    attackForwardLeft();
    moveDirection = MoveDirection::Left;
    return;
  }

  if (frontDetected && rightDetected)
  {
    attackForwardRight();
    moveDirection = MoveDirection::Right;
    return;
  }

  if (frontDetected)
  {
    moveForward(SPEED_ATTACK);
    return;
  }

  if (leftDetected)
  {
    turnLeft(SPEED_ALIGN_TURN);
    moveDirection = MoveDirection::Left;
    return;
  }

  if (rightDetected)
  {
    turnRight(SPEED_ALIGN_TURN);
    moveDirection = MoveDirection::Right;
    return;
  }

  searchForOpponent();
}

void searchForOpponent()
{
  if (moveDirection == MoveDirection::Left)
  {
    turnLeft(SPEED_SEARCH_TURN);
  }
  else
  {
    turnRight(SPEED_SEARCH_TURN);
  }
}

void moveForward(int16_t speed)
{
  setMotorOutputs(speed, speed);
}

void attackForwardLeft()
{
  setMotorOutputs(SPEED_ATTACK_CORRECT_INSIDE, SPEED_ATTACK);
}

void attackForwardRight()
{
  setMotorOutputs(SPEED_ATTACK, SPEED_ATTACK_CORRECT_INSIDE);
}

void turnLeft(int16_t speed)
{
  setMotorOutputs(-speed, speed);
}

void turnRight(int16_t speed)
{
  setMotorOutputs(speed, -speed);
}

uint16_t measuredDistanceOrMax(Adafruit_VL53L0X &sensor, bool ready)
{
  uint16_t distanceMm = 0;
  return readDistanceMillimeters(sensor, ready, distanceMm) ? distanceMm : UINT16_MAX;
}

bool isLineDetected()
{
  return digitalRead(LINE_SENSOR_PIN) == LINE_SENSOR_ACTIVE_STATE;
}

void setup()
{
  Serial.begin(115200);
  setupMotors();
  setupWiFi();
  setupWebOTA();
  setupProject();
}

void loop()
{
  server.handleClient();
  loopProject();
}
